[
  {
    "groupId": null,
    "groupName": "All",
    "sessions": [
      {
        "questionAnswers": [],
        "id": "539327",
        "title": "\"Getting Along and Getting Things Done: A Guide for Software Leaders Working with Developers\"",
        "description": "This session will provide software development leaders and managers with valuable insights and practical strategies for effectively managing and collaborating with developers in their teams. As a software development manager, the ability to lead and inspire a development team is crucial to the success of products and projects. \r\nMy presentation will explore various aspects of team management, including communication, motivation, conflict resolution, and fostering a positive work environment. \r\nAttendees will gain actionable tips and best practices for nurturing productive developer-manager relationships, optimizing workflow processes, and achieving product/project goals while maintaining a harmonious and motivated development team. Whether an experienced manager looking to refine their skills or new to the role, my presentation will equip them with the knowledge and tools to excel in leading their software development team to success.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "6f31d407-98ca-4b82-a009-6bb4d80b819c",
            "name": "Priya Jayakumar"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "552788",
        "title": "A design pattern goes to the supermarket",
        "description": "Everybody knows the term design patterns. Some know the patterns and correct implementation by heart. Others vaguely recognize the pattern names but don’t recall the details. This talk is intended for the latter group. \r\n\r\nI’ll dive into a couple of design patterns using real-life examples. What would a design pattern look like in day-to-day life? We’ll follow Bobby and Billie and discover how a design pattern would behave in a non-digital environment: the supermarket! With the help of drawings and code snippets, this talk will give you a solid understanding of design patterns, so you won't have to look them up ever again!",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "88a48ee1-1950-4e3f-8f4d-c5e269c6eeaf",
            "name": "Kaya Weers"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557019",
        "title": "A developer’s journey to Kubernetes: a handy guide for developing, deploying, and debugging your app",
        "description": "Containers are everywhere nowadays, and they have changed the way we develop, architect, deploy and troubleshoot our apps in production.\r\n\r\nThis talk will cover the most important things you need to know from developing containerized apps, to deploying them into your Kubernetes cluster, and finally, debugging them.\r\n\r\nWe will cover valuable tools to boost your productivity on Kubernetes—like Skaffold, Dart, Buildpacks and Jib—and discuss common deployment patterns and best practices. We know developers need to understand how to manage resources, application lifecycle and which K8s API objects to use for which component, and in this talk we’ll detail these important items. We also know that developers struggle to troubleshoot their deployed applications, because, well, things break and you need to figure out why!\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f2e1dff5-e8b9-4b4b-a8e4-4f5c6c61158f",
            "name": "Abdel Sghiouar"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207653,
                "name": "Cloud Infrastructure"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "547871",
        "title": "A Glance At The Java Performance Toolbox",
        "description": "What's the first step to improving performance?\r\n\r\nIs it tuning the garbage collector? Writing clean(er) code?\r\nNo, the first step is understanding what's going on in your application!\r\n\r\nPerformance tuning starts with analysis, and JDK tools can help you gain insights on classes and threads and can perform live GC analysis or heap dump postprocessing: jcmd, jconsole, jstat, jmap and jfr.\r\n\r\nWe'll examine the functional visibility areas essential to Java and how these tools provide that information. Moreover, will discuss options on how to integrate information gathered from these tools with widespread monitoring systems like Prometheus.\r\n\r\nAfter this talk, you will be ready to understand what your application spends time on and why so you can start improving its performance with complete information.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "086de2f4-8bfc-47ab-8f65-c623a5753fcf",
            "name": "Ana Maria Mihalceanu"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "553930",
        "title": "A Healthy diet for your Java application",
        "description": "Have you ever faced OutOfMemoryError? Was it in your CI or during the local run? Maybe you faced it as a user while playing your favorite video game or using online banking to pay your bills.\r\n\r\nThat’s annoying, isn’t it? Every time we give the application more and more memory, it seems never enough…\r\n\r\nIn Sonar we know how important it is to use memory efficiently. As our tools are often a part of your ci jobs, we care how much you spend on the infrastructure and try to minimize the cost.\r\n\r\nSo in this session, I will try to share some tips for investigating, fixing, and preventing potential memory leaks and reducing the memory footprint. In simple words, I will show how you can help your applications eat memory « healthier ».",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "eeb25beb-5d37-4fb7-acac-170357a1d89b",
            "name": "Marharyta Nedzelska"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557732",
        "title": "AI Proof Your Career With Software Architecture",
        "description": "The rapid rise of AI tools such as ChatGPT, Bard, GitHub Copilot, and others has many developers worried about their careers, and whether these tools will replace programmers. This session will reassure those developers and provide some guidance on staying employable in the age of AI.\r\n\r\nWe will begin by looking at some areas in software development that are least likely to be impacted by AI, such as embedded software, fintech, legal systems,  and avionics, but then we will concentrate on software design and architecture.\r\n\r\nYes, you can ask ChatGPT to write a REST API in Spring Boot with a JUnit test suite. But can you ask it to create an entire enterprise software system? With OpenID security, unit and integration tests, a deployment pipeline, management APIs, backup and rollover processes, an SLA of less than 100ms while supporting 100K concurrent users, providing localization for North American, South American, and European markets, handling PII (personally identifiable information), conform to Sarbanes-Oxley standards, and provide documentation? No. And probably not for the foreseeable future.\r\n\r\nWe will look at areas of software architecture and design to learn to provide job security. We will see how existing AI tools may coexist with human guided software architecture development. \r\n\r\nWe will wrap up with a brief look at ArchUnit - a library for testing the architecture of a Java application, and how it may be used to guide junior developers who use AI tools to generate the \"street level\" code in a project.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "b765d60f-4717-4116-b9f2-002c8a10bd88",
            "name": "Kelly Morrison"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551330",
        "title": "Analyzing and Critiquing Architectures",
        "description": "Software architecture is having a moment, from best selling books to packed classes, the software industry acknowledges the importance of the parts of software resistant to internet searches. Ample pixels have been spilt talking about patterns, decomposition, styles, diagrams and more and all to good ends! But when it comes time to review an architecture, what should you do? What factors should you consider? How do you provide constructive feedback? But we won’t just talk theory, we’ll work through real world examples, providing you a chance to practice this vital skill.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "1f3fa71c-0021-4d6e-af47-0013ecbaeb33",
            "name": "Nathaniel Schutta"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "552526",
        "title": "Apache Maven 102: Best Practices",
        "description": "Know enough about Maven to get by, but not enough to thrive? Then this talk is for you. We will review the basics and then dive into the best practices for both Maven single and multi-module projects. You will also walk away with enough knowledge to troubleshoot your builds.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "130a4bc5-3b04-4a0c-95e6-62fad0b4d722",
            "name": "Brian Demers"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556270",
        "title": "Application Observability like you've never heard before",
        "description": "Do you regularly spend sleepless nights desperately trying to make sense of cryptic error messages that seem to have been penned by a particularly grumpy Shakespearean ghostwriter? Are you frequently wondering about what your application is doing in production?\r\nPlease join us on this example-driven journey where we go through some of the more advanced topics of Observability, and we dive into the toolsets available for you today to instrument your application so that it can tell you what it is doing and why. We will explore how to instrument your JVM-based application without vendor lock-in using Micrometer, OpenTelemetry, Grafana, OpenZipkin, Prometheus, OpenMetrics, etc, so you can have a much better sense of what is going on inside of your app.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "8f517aca-8293-4e1f-9360-0ce676531421",
            "name": "Jonatan Ivanov"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "560139",
        "title": "Architecting for Resiliency: Shuffle sharding for Workload Isolation",
        "description": "Multi-tenant, cloud-based architectures have a set of resiliency requirements that are often at odds with customer satisfaction and cost requirements.\r\n\r\nOne 'bad actor' can impact all your other clients, or exceed your budget models. This talk will introduce the architectural pattern of Shuffle Sharding, discuss the situations it can help mitigate, the pros and cons of the pattern, and review some examples of its use.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "db3f7afe-0214-49a6-853e-e40ea87a6b5a",
            "name": "Christopher Curtin"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "547703",
        "title": "Architectural Design Patterns Deep Dive",
        "description": "In this day-long work workshop, we will review a catalog of all the standard architectural design patterns. For each design pattern, we will run docker-compose files that demonstrate the strengths and weaknesses of those design patterns. So, you have a first-hand, full-on, and highly engaged full-day workshop to give you the knowledge you need to make critical architectural choices.\r\n\r\nAll labs and examples will be using docker-compose. The examples that we will be focusing on in this intensive workshop include:\r\n\r\n* Hexagonal Architecture\r\n* Domain Driven Design\r\n* Circuit Breaker\r\n* Retry\r\n* Bulkhead\r\n* Ambassador\r\n* Event Sourcing\r\n* Competing Consumers\r\n* Claim Check\r\n* Materialized Views\r\n* CQRS (Command-Query Responsibility Segregation)\r\n* Strangler Fig\r\n* Gatekeeper\r\n* Valet Key\r\n* Saga Pattern\r\n* Data Mesh",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "6f19875d-369e-4b4f-a1f7-2d93725ab36d",
            "name": "Daniel Hinojosa"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207666,
                "name": "workshop"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "540114",
        "title": "Architectural Resiliency",
        "description": "Regardless of the techniques used to make enterprise solutions Highly Available (HA), failure at some point inevitable. Resiliency is how fast a system reacts and then recovers to such failures. Failure of Highly Available (HA) enterprise solutions is inevitable. This presentation covers a number of architectural resiliency techniques and patterns that help increase Mean Time to Failure (MTTF), a.k.a Fault Tolerance and decrease Mean Time to Recovery (MTTR).",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "cfeff178-8c6d-45bd-994c-34aa448ac75c",
            "name": "Jeremy Deane"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "540546",
        "title": "Are Your Tests Slowing You Down?",
        "description": "Testing is a Good Thing, right? Especially automated testing. But \"Good things come to those who wait\" is not something that's going to appeal to the busy developer. You want results, and you want them now. You're in The Zone working on a problem, and the last thing you want is to break your flow wrestling with your testing framework or waiting for the tests to finish running.\r\n\r\nMore code means more tests. More coverage means more tests. More tests mean more time. Time that you want to spend being productive, creative, innovative. How can you balance the need for quality with the need for speed?\r\n\r\nIn this talk, Trisha will identify issues that slow down developers when writing, running and debugging tests, and look at tools that can help developers with each of these problems. There will be live coding, analysis of social media poll results, an overview of solutions in this space, \"best practice\" recommendations, and machine learning will be mentioned at some point.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "5eff389f-6760-4a05-affb-ec5b6fc2ca36",
            "name": "Trisha Gee"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557183",
        "title": "Automated software refactoring with OpenRewrite and Generative AI",
        "description": "The software industrial revolution has arrived. Software is now 80% open source and third-party\r\nand 20% proprietary code that stitches it together into business-critical applications. In these large and diversely composed codebases, dependencies change frequently at their own pace and security vulnerabilities can be introduced at any time by anyone. Not updating software regularly leads to critical bugs, performance, and security issues (plus your code can just get harder to work with!).\r\n\r\nMass code refactoring in these massive codebases is a multi-point operation that requires accuracy and consistency. It’s about affecting change across many individual cursor positions in thousands of repositories representing tens or hundreds of millions of lines of code. Whether you’re migrating frameworks or guarding against vulnerabilities, this requires coordination, tracking, and accuracy. \r\n\r\nThis is not a problem AI can solve alone. AI, like many humans, is not good at math and programming. AI needs a computer just like a human does.\r\n\r\nIn this talk, we’ll discuss automated code remediation with the deterministic OpenRewrite refactoring engine, a technology born at Netflix in 2016. It’s built on manipulating the Lossless Semantic Tree (LST) representation of code with recipes (programs) that result in 100% accurate style-preserving code transformations. It is a rule-based, authoritative system.\r\n\r\nThen we’ll show how to couple the precision of a rules-based system with the power of AI.\r\nWe'll demonstrate a generative AI procedure that samples source code to identify defects and uses OpenRewrite to fix them. This is a general purpose pattern you're going to start seeing a lot of — \"ChatGPT gets a computer\" (with OpenRewrite as the computer in this case).",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "ac15c088-f8fe-44a8-9a82-3b92b39456e1",
            "name": "Jonathan Schneider"
          },
          {
            "id": "b51a2283-5d04-438c-93a2-3474d6491c55",
            "name": "Justine Gehring"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "544499",
        "title": "Battling your Biased Brain",
        "description": "Ever heard of the IKEA effect or the bandwagon-effect? In our efforts to delivering great software, there are numerous occasions where our brain tries to trick us. Don’t fall for them!\r\n\r\nIn this talk we will dive into some well-known and researched cognitive biases that impact our judgments in our day-to-day jobs as software creators.\r\nWhen do they typically occur? And why are we falling into these traps from time to time?\r\n\r\nAfter this talk you'll have a better understanding of how your brain tricks you, how to make better decisions and in the end how to deliver some great software.\r\n\r\nA word of warning; during this talk you may get tricked!",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "719a72a0-c85f-476b-b9fc-23c4c816ca61",
            "name": "Peter Wessels"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207651,
                "name": "Agile"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557439",
        "title": "Best Practices For Java in Cloud Native Architectures",
        "description": "In this session, we'll explore the challenges of optimizing Java deployments in dynamic scaling, container, and cloud function environments. \r\nWe'll dig into resource management, garbage collection, cold start issues, classpath and dependency management, performance monitoring, and potential security issues.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "78100ec6-45ab-4076-8911-266bfc4c376b",
            "name": "Dennis Ruzeski"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207654,
                "name": "Cloud Technology"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "543941",
        "title": "Beware of Survivorship Bias!",
        "description": "Most talks on a typical conference schedule contain success stories of technology. This could lead to survivorship bias. Survivorship bias causes you to draw false conclusions because you mostly heard about successes, but hardly ever about failures. Yet failures provide us with lots of valuable knowledge: when not to apply a certain technique, pattern or process.\r\n\r\nSo no success stories in this talk! Just some 'silver bullets' we tried to use to solve our problems, but turned out to be Very Bad Ideas™. We’ll share how survivorship bias can easily influence your ideas and cloud your judgement.\r\n\r\nAfter attending this talk you'll be more aware of survivorship bias and what you can do to keep your head cool, no matter how many 'silver bullets' are fired at you. ",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "a46bbee6-8f57-450a-881f-22291d822ad8",
            "name": "Hanno Embregts"
          },
          {
            "id": "42e68026-7d32-4cf7-8b71-84cfe2096cc2",
            "name": "Maarten Mulders"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556029",
        "title": "Bootiful Spring Boot 3.x",
        "description": "Spring Framework 6.x and Spring Boot 3.x are almost here and you know what that means? New .jars! And also new baselines and new possibilities! Spring Framework implies a Java 17 and Jakarta EE baseline, and offers new support for building GraalVM-native images. It also offers a new observability layer, an amalgamation of some of the work in the Micrometer project and Spring Cloud Sleuth. Spring Boot 3 builds upon all of this, and integrates all of this into our application. Join me, Spring Developer Advocate Josh Long (@starbuxman), and we'll look at next-gen Spring and learn why, with Spring taken together with Java 21, there's never been a better time to Java developer.\r\n\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f2617bc2-d35e-4fd7-9cea-02060f3e1608",
            "name": "Josh Long"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551307",
        "title": "Breaking AI: Live coding and hacking applications with Generative AI",
        "description": "Is your organisation ready to revolutionize your coding experience with generative AI tools, like copilot, ChatGPT, or code whisperer? Do you know how to code safely with generative AI tools increasing your delivery speed without compromising security? In this session, we’ll discuss some of the dangers of generative AI, including hallucinations and security risks. We’ll live code a Spring coffee shop application using copilot, and ChatGPT, and live hack the results, showing how the generated code can be exploited in a running app. We’ll uncover generated SQL injections, Cross site scripting, directory traversal and more. Don't miss this electrifying opportunity to explore the cutting edge of coding technology. Join us and embark on a journey where velocity meets security, and innovation knows no bounds. Secure your spot now and get ready to code like never before! In this session you'll learn how you can leverage the power of AI to increase your velocity while mitigating risks and staying secure.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "5e7219be-ad38-4708-884f-d6fbfb51490a",
            "name": "Simon Maple"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551429",
        "title": "Build next generation Big Data applications with Delta Lake",
        "description": "    Delta Lake (https://delta.io/) is an open-source storage framework that enables building a Lakehouse architecture with compute engines including Spark and also APIs for Scala/Java, Python and Rust. A Lakehouse is a modern data architecture that reimagines data warehouses in response to the availability of affordable and highly reliable storage solutions. \r\n\r\n    Delta Lake provides key benefits and will fit perfectly in your Big Data architecture:\r\n     - ACID Transactions\r\n     - Schema Evolution\r\n     - Time Travel\r\n     - Audit History\r\n     - Handle petabyte-scale tables\r\n     - Platform Agnostic (Cloud, On-prem, or locally)\r\n     - DML operations through its SQL and Spark API \r\n\r\n     \r\n\r\n    In this presentation, I will provide an introduction to Delta Lake, explaining how it works, and its key features and benefits. Whether you're a data scientist, data engineer, or business analyst, this session is for you.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "10246aaa-5ac0-4a8c-b0f5-0c4d69e54ca1",
            "name": "Theo Lebrun"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207654,
                "name": "Cloud Technology"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537809",
        "title": "Building a Great Developer Experience",
        "description": "If you want to onboard developers quickly, and retain them by providing a frustration-free environment, you need a great developer experience (DX). This goes beyond just providing CI/CD. It requires runtime libraries, build tooling, local environmets, data collection and displays, and migration automation. All of these work together to create a constant two-way stream of information between the platform engineers and their client development teams.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "bfc36fe5-4d43-4394-98fe-a5374fc17616",
            "name": "John Burns"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207651,
                "name": "Agile"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537786",
        "title": "Building Intelligent Applications with ChatGPT",
        "description": "As software engineers, we have the incredible opportunity to harness the power of ChatGPT to elevate our applications to new heights of interactivity and intelligence. Join this conference talk to dive into the world of the ChatGPT/OpenAI API and ChatGPT Plugins. Learn how to use the API in your Java projects and integrate your existing Java APIs into the ChatGPT UI. You'll learn to use ChatGPT's conversational capabilities and create innovative applications that understand, respond, and engage with users in natural language. Unleash the power of AI-driven interactions and take your applications to the next level.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "140644c4-887a-4227-84e3-4f737ab9d428",
            "name": "Kesha Williams"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557361",
        "title": "Building RESTful Web Services with Jakarta EE",
        "description": "In this workshop you will examine and work with the Jakarta EE 10 implementation of Jakarta REST 3.1. You will work through several modules that will provide you with experience in developing RESTful services. Not only will you be looking at the traditional hosting of REST services on an application server, but you will also learn how to embed a specialized REST server in most any type of Java application. It does not end there as this workshop will show you how to implement REST clients using JSON-B to go from an object to JSON and then back again. Come prepared to discuss what you will want to do with REST and then workshop your needs.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "3b93f05b-f376-44fb-9876-d8a84491a6cd",
            "name": "Kenneth Fogel"
          },
          {
            "id": "cdc2288a-56cf-40ec-bc39-ca5d9fb59b27",
            "name": "Ivar Grimstad"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 219279,
                "name": "JakartaEE"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207666,
                "name": "workshop"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "548614",
        "title": "Building Your Own Private GenAI Chatbot with Java Tools - A Step-by-Step Adventure",
        "description": "In today's software development world, there are several Machine Learning (ML) tools that empower developers to create specific chatbots that cater to various needs. These chatbots harness the capabilities of Large Language Models (LLMs) trained on confidential, private document sets on your local machine or enterprise data repositories. They enable you to interact and engage with these document sets, from summarizing emails and meeting notes to gauging sentiment, extracting dates and names from websites, pre-screening resumes, and performing many other tasks.\r\n\r\nBut most of these systems are Python-based.  While Python serves as a formidable language for ML, many software developers find themselves operating within the Java ecosystem, especially within large organizations that prioritize Java for robust and reliable production deployments. This presentation focuses on Java-centric tools to construct tuned assistant systems using the retrieval-augmented generation (RAG) technique.\r\n\r\nQuick Overview of Neural Networks, Weights, and Embeddings\r\nExploring the Current State of LLMs\r\nImplementing Prompts and Completions via a Java API to ChatGPT\r\nUnderstanding Prompt Structure and Prompt Engineering Techniques\r\nLearn about Instruction-Tuning and Fine-Tuning Techniques\r\nNavigating Vector Databases and Embeddings with Java\r\nCrafting a Private Chatbot Architecture\r\nDemo\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "a56899b4-eae5-40ac-b71a-5ef5be0945a0",
            "name": "Frank Greco"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "549597",
        "title": "Cache Me If You Can: Speed Up Your JVM With Project Valhalla",
        "description": "OpenJDK’s Project Valhalla is set to revolutionize how the JVM handles data objects in memory. By bringing the characteristics of primitives to Java objects and classes you’ll see denser memory layouts that can lead to many advantages such as improved cache performance and a smaller memory footprint.\r\nThis talk offers an exploration of Valhalla's objectives, progress, and its potential impact on the Java ecosystem with examples throughout. Come discover how Project Valhalla is on the verge of reshaping the landscape of Java, paving the way for a more efficient and high-performing future.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "5b876b41-adcf-4322-ade7-e55aaf1d004e",
            "name": "Theresa Mammarella"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "549522",
        "title": "Calling AI Tools from Java",
        "description": "As far as Java is concerned, most AI tools are just another RESTful web service. In this session, learn how to use modern Java features like records, text blocks, the HTTP Client API and more to access ChatGPT, the Whisper audio-to-text transcription API, and image generators like DALL-E, Stable Diffusion, and Midjourney.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "ecda0d84-be59-41c6-8983-b58cd5b3f93c",
            "name": "Kenneth Kousen"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "577478",
        "title": "Choose Your Own Performance; a Project Leyden Update!",
        "description": "Project Leyden allows developers to selectively improve startup time, time to peak performance, and the footprint of Java programs, by doubling down on Java's super power of speculative optimization using capabilities built directly into the JDK. See how speculative optimizations allow AOT (ahead-of-time compilation) code to make tradeoffs between Java's static and dynamic nature as well as how new tools like Condensers and ComputedConstants may play role in further improvements.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "00018bec-730b-4775-bfb5-67cb589c7042",
            "name": "Dan Heidinga"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537768",
        "title": "Clean code, is it really worth it?",
        "description": "As developers, we participate every day in our software life cycle adding new logic, adapting the existing one, and integrating with services or platforms.\r\n\r\nBut, do we put the same effort into making software robust, maintainable, consistent, secure, clear, and tested?\r\n\r\nIn this session, I will show the need for good practices in Clean Code along with the issues of not using it, showing concepts like Clean As You Code (CAYC) using free and open-source tools.\r\n\r\nClean Code goes beyond the produced software and its programming language. Is a fundamental part of a developer's role growth, something that represents us no matter the language and the company where we work. Do not lose the thread.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f63ba6f7-e39c-426f-b079-55a63c063bda",
            "name": "Jonathan Vila"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "538171",
        "title": "Coding Fast and Slow: Applying Kahneman's Insights to Improve Development Practices and Efficiency",
        "description": "Embark on an exciting journey into the intersection of psychology, software development, and Developer Productivity Engineering (DPE) as we explore how Nobel laureate Daniel Kahneman's groundbreaking work on the psychology of judgment and decision-making can optimize your development practices while conserving cognitive resources. Discover the impact of System 1 and System 2 thinking on the software development process, and learn to strike the perfect balance between \"fast\" intuitive thinking and \"slow\" deliberative reasoning.\r\nWe'll delve into practical DPE strategies for reducing mental fatigue and minimizing context switches, focusing on techniques like build system performance optimization, test parallelization,  AI-powered test selection, and developer productivity observability. By leveraging these best practices, you'll enhance your and your team's productivity and maintain focus on high-value tasks.\r\nWhether you're an experienced developer seeking to boost your performance or a curious newcomer eager to learn about the connections between the human mind, software development, and DPE, this talk is for you. Join us for an exhilarating adventure into the fast and slow worlds of coding, and uncover new ways to maximize your cognitive resources.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "1708bdeb-e8d9-4628-a147-e9878198c900",
            "name": "Baruch Sadogursky"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "573390",
        "title": "Community hacks to enhance your career",
        "description": "Do you feel it’s no longer enough to just be a great developer? Does advancing your career mean you have to be blogging, speaking at conferences, engaging on social media, committing to open source and other things distracting you from actually building software?\r\n\r\nYou’ll do well to ensure that the people making decisions about your career are hearing and seeing your name and associating it with progress and other cool and positive things (and truth, they probably aren’t looking at your code).\r\n\r\nIn this session we’ll explore some of the best practices that assist in not having to do it all from scratch. Knowing what you are doing can give you an easier path to visible contributions to the community.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "1038e701-f663-46f8-a01b-925f2f74d004",
            "name": "Sam Hepburn"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "552455",
        "title": "Configuration security as a game of pursuit intercept",
        "description": "In this session we will take a look at the emerging field of cloud security posture management and how we can approach the problem space using a class of board games known as pursuit/intercept. Using the game Scotland Yard as a visual illustration we'll explore the cognitive and technical limitations that all CSPM systems face and what you should look for when evaluating the strengths and weakness of CSPM vendors.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "9f4c5484-3a97-4a43-9410-05b2007f83bb",
            "name": "Wes Widner"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "549463",
        "title": "Connect the Tables: How to Graph Relational Databases",
        "description": "You might have heard about graphs, but what if you already have a relational database? How do you incorporate something new? This session will show you how to translate part or all data from a relational format into a graph.\r\n\r\nWe will cover the basics of migrating the model and practical steps for actually implementing it. We will walk through naming and case conventions for graphs, as well as some principles for a successful graph model. At each step, we will show live code for making this work in the real world. Come to this session to get concrete steps for graphing relational databases.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "b5ea9e64-ad10-477c-8444-cc00339b8dc5",
            "name": "Jennifer Reif"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "541466",
        "title": "Contextual search with vector search: exploring your options with open source tools.",
        "description": "Have you noticed the recent improvement in how our searches have become smarter? It's fascinating how vector search technology has enhanced our contextual search experience.\r\n\r\nThe underlying idea is quite straightforward. For example, let's consider an example of a movie recommendation system. The idea is to represent each movie in our catalog as a vector, a numerical representation of a piece of text.\r\n\r\nOnce we're done with that and also converted the search phrase into a vector, we step into a whole new realm — a multidimensional space where these vectors replace the original text values. Through some mathematical techniques, we can determine which movie representations are closest to the vector representing our search query!\r\n\r\nHow do we create such vector representations? We need an AI model trained on vast amounts of data to recognize patterns and effectively convert text phrases into vectors. \r\n\r\nAll of this you’ll learn in this session. We'll try out different data solutions - ClickHouse, OpenSearch and PGVector. We'll also explore different models available depending on your language preference and skills, or, in case you 'd rather not run the model locally, what APIs you can use to do data inference for free.\r\n\r\nPlenty of demos and a bit of coding for each of the options. This session will be useful for anyone who is intrigued by contextual search and usage of AI, but might find themselves overwhelmed by the complexities to get started.\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "5ecff6ff-7704-433e-a38f-a057d05eacec",
            "name": "Olena Kutsenko"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557403",
        "title": "Counter Attack: Vector Based methods for Detecting Large Language Model Generated Text and Audio",
        "description": "The advent of large token width Large Language Models (LLMs) such as ChatGPT and their ilk has significantly increased the problem of reliable detection. Organizations are now using LLMs to generate text content with targeted precision at a massive scale with the objective of artificially amplifying false narratives and negative propaganda. As part of a broader Counter AI research program we have investigated ways for addressing this problem. In this presentation we will discuss and demonstrate one such promising technique called Masked Permutations. \r\n\r\nThis technique removes a subset of the words and phrases from an arbitrary input text and has the targeted LLM model “fill in the blanks” for a nontrivial collection of permutations. These permutations are then clustered using a manifold approximation technique. With the clustered projection of the LLM embedding vectors in hand, a proximity distance measurement from the original text is then used to determine likelihood of LLM generation. \r\n\r\nThis approach has shown great potential in experimentation as being a practical method of detection that has the potential to scale up as LLMs scale while offering an asymmetric cost advantage. The discussion will include a live software demonstration using a JHUAPL developed interactive 3D XAI analysis tool called Trinity.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "4b126c39-e57e-4882-9d41-1c78cb6662b5",
            "name": "Sean Phillips"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556761",
        "title": "Crafting Code with a Conscience: Your Role in Ethical Data Stewardship",
        "description": "Ensuring ethical data handling is not just about compliance; it’s a moral imperative. Dive into this critical session to understand how dev teams can arm themselves with a curated set of tools, insights, and frameworks designed to seamlessly integrate ethics into your development process while championing & influencing ethical data stewardship. ",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "bd133af7-d326-4bdd-b960-dea75e0d6637",
            "name": "Nyah Macklin"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207651,
                "name": "Agile"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "567652",
        "title": "Crossing The Streams - leveraging Pulsar IO + Pulsar Functions together with Spring Cloud Stream",
        "description": "Apache® Pulsar™ is an open-source, distributed messaging and streaming platform built for the cloud. It provides Pulsar Functions and Pulsar IO connectors which can be leveraged to build Pulsar message processing applications.\r\nSpring Cloud Stream is a framework for building message-driven micro-service applications. It provides a Pulsar binder implementation that can be used to build Pulsar message-processing applications.\r\nBoth of these solutions share a high degree of feature overlap and either could be used to solve the same problem. However, it need not be an ‘either-or’ proposition, they can actually be used in tandem.\r\nIn this talk, we will demonstrate Pulsar Functions and Pulsar IO connectors and show how Spring for Apache Pulsar simplifies their usage.  We will also show how to use the Spring Cloud Stream Pulsar Binder in your application.  Finally, we will “cross the streams” and leverage these technologies together to build a Pulsar message processing application.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "974e24f5-044f-4552-a362-fdefd445dabc",
            "name": "Chris Bono"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "568265",
        "title": "Cruising Along with Java: Making use of the Modern Features",
        "description": "Java was once a language that dragged along at snail's pace. Thankfully, that's no longer the case. In the recent years the pace of development has accelerated, both in language features and in the JDK improvements. Come along to dive into some of the recent changes of Java that are both fun and powerful to use, to learn how you can benefit from these, and we'll also discuss where the language is heading in the near future.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "b576bdc5-c994-40f5-b1dd-e0f9f7999fa9",
            "name": "Venkat Subramaniam"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207666,
                "name": "workshop"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "547420",
        "title": "Databaseless Data Processing with EclipseStore and WebSphere Liberty InstantOn",
        "description": "More and more companies and organizations are using AI, ML, VR and big data in the cloud. 3 factors are most critical for all of them: high performance, low data storage costs, and simple, fast and cost-efficient implementation and maintenance. Traditional databases and persistence frameworks worked well so far, however for the beginning AI age they are too slow, implementing is complex, and databases are too expensive in the cloud. That's why many innovative companies such as online banks or gaming companies have built their individual high-performance systems with pure Java with high effort to meet their requirements. Now, with EclipseStore there is a leight-weight and easy to use framework. EclipseStore enables databaseless high-performance in-memory data processing for modern cloud-native Java applications and microservices. It lets you store any Java object graph of any size and complexity seamlessly into any cloud binary data storage. Users benefit from ultra-fast in-memory data processing, up to 1000x faster queries, up to 99% cloud database cost savings, and unrivaled simplicity. WebSphere Liberty InstantOn enables EclipseStore cluster nodes starting in milliseconds without the need for using GraalVM native images. ",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f465d18e-ff85-47b9-9997-f00a602ac48d",
            "name": "Markus Kett"
          },
          {
            "id": "d646eb1d-f4a3-41fe-9d99-9eac7abf2789",
            "name": "Mark Stoodley"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 219279,
                "name": "JakartaEE"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "548368",
        "title": "Death to the Monolith",
        "description": "Monolithic architecture has been the traditional approach for building web applications, but it often leads to a rigid, inflexible, and slow development process. Micro-frontends, on the other hand, allows for breaking down large, complex applications into smaller, more manageable pieces that can be developed, tested, and deployed independently. In this talk, we will learn how to say \"death to the monolith\" and embrace micro-frontends as an architecture pattern.\r\n\r\nBy exploring the problems with monolithic architecture we will discuss why it's time to move away from it. A monolithic architecture can lead to a lack of agility, difficulty in scaling, and an increased risk of failure. Meanwhile, a micro-frontend architecture pattern allows for a more flexible, scalable, and efficient development process.\r\n\r\nNext, we will look at how an application composition platform provides a framework for creating and managing micro-frontends, including tools for versioning, testing, and deploying them. We will discuss how an application composition platform can help ensure consistency across micro-frontends by providing a centralized location for managing shared resources.\r\n\r\nFinally, we will learn how embracing micro-frontend architecture with an application composition platform can enable organizations to become more agile and efficient. Additionally, we will explore how micro-frontend architecture can enable rapid prototyping, reduce time to market, and allow for easier scaling of applications.\r\n\r\nAttendees of this talk will leave with a deeper understanding of the problems with monolithic architecture and the benefits of micro-frontend architecture. They will gain practical tips and strategies for building micro-frontends that are flexible, maintainable, and optimized for performance using an application composition platform. They will also learn how embracing micro-frontend architecture can enable organizations to become more agile and efficient in their development process.\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "3c467866-b387-417c-acc3-0d06a2d64f3f",
            "name": "Cody Frenzel"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "538002",
        "title": "Designing media optimized byte transfer and storage at Netflix",
        "description": "Netflix is a media streaming company and a movie studio with data at exabyte scale. Most of the data generated, transferred and stored at Netflix is very media specific, for example, raw camera footage, or data generated as a result of encoding and rendering for different screen types.\r\n\r\nIn this session, I will throw light on how we design a media aware and optimized transfer, storage and presentation layer for data.\r\n\r\nBy leveraging this architecture at Netflix scale, we provide a scalable, reliable, and optimized backend layer for media data.\r\n\r\nMajor takeaways from this session\r\n- Learn about the challenges of designing a scalable object storage layer for data while adhering to the file system POSIX semantics of media applications\r\n- Learn about the optimizations applied to reduce cloud storage footprint, such as chunking, deduplication\r\n- Learn about how different applications expect data to be presented at different locations and in different formats.\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "0e577c69-f95e-4044-a53c-d626732f2bb6",
            "name": "Tejas Chopra"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207653,
                "name": "Cloud Infrastructure"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537943",
        "title": "Do you really need Hibernate?",
        "description": "Projects often use Java Persistence API (JPA) by default and, thus, mostly Hibernate. But do all applications need a comprehensive object/relational mapping (ORM) with all conceivable functions?\r\n\r\nThis talk examines the architecture of database-centric applications and discusses whether you always need an object graph for persistence.\r\n\r\nUsing an example application, it is shown how pure SQL, with the help of jOOQ and (nested) Java Records simplifies data access and how common ORM problems, such as the n+1 select problem, can be avoided.\r\nFinally, the possibility of combining jOOQ and JPA/Hibernate and thus using the best of both worlds is discussed.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "8d6bb73e-5451-4e33-a0ab-7b7ffc37a52e",
            "name": "Simon Martinelli"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557734",
        "title": "Don’t Expect Developers to be Security Experts!",
        "description": "Developers are not security experts! Why not? And should they be?\r\n\r\nWe’re still learning — sometimes through trial and error — the best way to tackle security issues that won’t negatively interfere with delivering functional (and secure) software.\r\n\r\nOne thing is sure, there is only a subset of prevention and mitigation strategies that make sense to put on a developer’s plate. Even then, assuming all devs are equipped to handle this additional workload is unreasonable.\r\n\r\nMelissa will define common security related terms and lingo; share typical places to shore up applications when it comes to dependencies, packaging, and supply chain concerns; and discuss the plethora of scanning tools available today and how they actually work. Learn how to integrate a measure of security that makes sense in existing development processes and how to introduce a security culture to your team in a healthy way without exhausting your developers.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "2718989a-00fd-4ea2-b459-d4b4116e8b12",
            "name": "Melissa McKay"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "538515",
        "title": "Don't Get Burned! Secure Coding Essentials to protect your application",
        "description": "As a developer, you understand the importance of writing code that is functional, scalable, and maintainable. But how about secure code? Even the most seasoned developer can make common security mistakes that leave your code vulnerable to attack. In this session, we'll explore the most common and sometimes unknown security pitfalls made by developers and provide practical tips for avoiding them. We'll cover everything from input validation errors to injection to file overwrites and arbitrary code execution. We'll show real-world examples of insecure code and demonstrate how attackers exploit these vulnerabilities before showing you how to fix these code constructions. By understanding how these mistakes get exploited, you'll be better equipped to write secure, bulletproof code that can withstand attacks. Whether you're a junior developer just starting out or a seasoned pro looking to brush up on your skills, this session is a must-attend for anyone concerned with the security of their applications. Let’s start writing secure code and learn how to avoid security mistakes.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "50e931e4-bda7-4065-b4c4-5083683497e6",
            "name": "Brian Vermeer"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551993",
        "title": "Effectively Troubleshoot 9 Types of OutOfMemoryError",
        "description": "Embark on a journey into the depths of java.lang.OutOfMemoryError as we unravel its complex nature. Discover the nine distinct faces of this memory-related challenge and gain valuable insights into their unique causes and solutions. This session equips you with the knowledge, tools, and techniques needed to troubleshoot and conquer OutOfMemoryError in all its forms, ensuring smoother, more efficient Java applications.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "96f21f95-15a9-4bed-a14a-495947087740",
            "name": "Ram Lakshmanan"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "555596",
        "title": "Enter The Parallel Universe of the Vector API",
        "description": "Single Instruction Multiple Data (SIMD) instructions have been available in Intel and other processor instruction sets for over 25 years.  The current implementation is Advanced Vector eXtensions (AVX), first introduced in the Sandy Bridge microarchitecture.\r\n\r\nUsing Vector processing through AVX can profoundly improve the performance level of an application that includes numerically intensive operations.  The difficulty is that, although the compiler should be responsible for determining their use, code is often too complex to do so effectively.\r\n\r\nIn JDK 16, an incubator module for the Vector API (not to be confused with the Vector collections class) was introduced.  This allows a developer to express vector computations that reliably compile at runtime to optimal vector instructions.  The API has undergone several revisions resulting in the sixth incubator in JDK 21.\r\n\r\nIn this session, we'll explore how to use the Vector API in different use cases, comparing the code generated by the JIT compiler without the API and with it.  We'll also look at what difference this makes to the performance delivered.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "709043d1-5754-4459-a8d5-6dd2f5619874",
            "name": "Simon Ritter"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556795",
        "title": "FinOps Tooling is a magic wand for enhancing Performance and Customer Value",
        "description": "I knew our journey into adopting FinOps would result in Cloud Cost Savings, but I was surprised to see how effective it could be at finding performance issues, bugs, and even challenging things like our product pricing.\r\n\r\nThis session will walk through what FinOps is, the results of our adoption, and the interesting observations that surprised us along the way.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "a3068189-ae77-404e-abcd-2d18c47adf2b",
            "name": "Jeremiah Drysdale"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537982",
        "title": "Focus on software, not code",
        "description": "There is a recent trend to focus too much on code, sometimes losing sight of the end goal, which is running software, and it's costing everybody precious time and money.\r\nI will talk about the difference between code and software, and why it's so important to focus on the latter, without dismissing the former, using real-life examples and situations to illustrate the benefits of focusing on software and not just code, such as prioritizing optimizations, improving performance, fixing bugs, and even keeping tech debt under control.\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "2b16e922-4d90-4637-8a92-9030591a8ef9",
            "name": "Enrique Zamudio"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207658,
                "name": "Practices and other tech"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556248",
        "title": "From Mosaic to Modern: The Evolution of Web App Architectures",
        "description": "The introduction of the NCSA Mosaic browser in 1993 marked the inception of the modern web. What began as a platform for static hypertext documents rapidly evolved, embracing dynamic content, interactive functionality, and eventually the extensive capabilities of today's rich web applications. In this session, we will:\r\n\r\n* Explore the pivotal shifts in web application architectures from the early 1990s to the present.\r\n* Highlight the successful strategies, acknowledge the missteps, and identify the driving factors behind each architectural choice.\r\n* Offer insights into the repeated patterns and lessons learned from history.\r\n\r\nWith a keen understanding of the past, attendees will be better poised to approach future web development challenges with clarity and confidence. Join this journey through time to gain a deeper appreciation of the web's evolution and prepare for what lies ahead.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "ff0a1dd3-c9f2-48e2-88a8-9c0e429251be",
            "name": "Kito Mann"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551473",
        "title": "Fullstack from the back! Better business application development",
        "description": "This session will guide attendees through building data-rich business applications in an efficient way through the use of Hilla and Flow, two web frameworks written by the company, Vaadin. Flow Vaadin Flow is a unique full-stack framework that lets you build web apps without writing HTML or JavaScript. You compose the UI from components, connect it to a data source and react to user events. The UI runs on the JVM without the need to expose REST services or come up with other ways to move data to the browser.\r\nThe other framework, Hilla, is an open source framework that integrates a Spring Boot Java backend with a reactive TypeScript frontend. It works with React or Lit and helps you build business apps faster with type-safe server communication, included UI components, and integrated tooling.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "453dc8ab-94d9-4858-923a-ecddaa493949",
            "name": "Lawrence Lockhart"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557192",
        "title": "Fundamentals of Migration Engineering with OpenRewrite",
        "description": "How adaptable is your technology stack to changes in business requirements, technological advancements, and the availability of new and better tools (and avoiding vendor lock-in!)?\r\n\r\nWhen you can more easily secure, upgrade, move, or modernize your code, that means you can adapt quickly and efficiently to changes in technology and markets. That’s what Migration Engineering is all about, which we’ll be exploring in this workshop.\r\n\r\nWe’ll discuss and demonstrate how to write custom recipes using OpenRewrite, an open source auto-refactoring tool, to study and analyze your code before planning migration and modernization efforts—and then automate code changes for your teams. \r\n\r\nYou’ll also learn how to write recipes that will automate code search and transformation actions that are custom to your organization. We will assemble these recipes with the visitor pattern, show how to stitch recipes together with YAML, with Refaster-style templates, with Semgrep matchers, etc. \r\n\r\nThis is a comprehensive look at all kinds of recipe development. You will come away fully equipped to plan and exercise large scale code transformations in your organization.\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "ac15c088-f8fe-44a8-9a82-3b92b39456e1",
            "name": "Jonathan Schneider"
          },
          {
            "id": "35870981-512d-4c0e-b3af-682799a959a3",
            "name": "Olga Kundzich"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207666,
                "name": "workshop"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "538286",
        "title": "How Composable Architectures can actually solve the reasons for Microservices",
        "description": "Many companies today want a faster time-to-market, more flexibility, and scalability for their digital services. Investments are often made in IT for this, such as a “migration to the cloud” and developing “microservices”. However, the result is often that such a transition and development becomes more complex and more expensive, instead of being able to take advantage of the anticipated benefits. So what causes this? Which aspect is missing from the application of cloud infrastructure and microservices? What can you do to make them beneficial? This is where Composable Architecture comes in! In this session, I will 1) Elaborate on Composable Architecture and how we got there; 2) Define the value of applying composable architectures using the Composable Enterprise as a framework; 3) Share how I applied Composable Architectures in projects, and what I learned from it",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "1acc6fe1-fb77-411b-acbb-fef29174c780",
            "name": "Edwin Derks"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556927",
        "title": "How to choose the right database for your application",
        "description": "In this talk, we will review the strengths and qualities of each database type from their particular use-case perspectives. Although having everything in one database seems like the straightforward path, it is not always the most cost or time effective path. Many Databases have become more specialized for the types of data they handle. Learn how to make the right choice for your workloads with this walkthrough of a set of distinct database types (graph, in-memory, search, columnar, document, relational, key-value, and time series databases). Learn about current trends in the database ecosystem and then learn about a number of different specialized databases and their strengths and weaknesses. This presentation will go over some of the fastest growing segments in the database space.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "8908ee3e-c72a-4125-b71d-98e39ce27c0b",
            "name": "zoe Steinkamp"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557526",
        "title": "How to Conference : A User Guide",
        "description": "Are you an introvert who dreads large gatherings? Do you find it challenging to attend tech conferences or user group events? We know how you feel, but the good news is that these gatherings present invaluable opportunities to expand your knowledge, enhance your skills, and even discover your next career move. The key is to navigate them effectively without feeling overwhelmed.\r\n\r\nJoin us as we discuss how introverts can make the most of conferences and user groups without exhausting themselves. In this session, we will explore strategies to ensure your success, from what to bring to these events, to uncovering the most effective learning methods and practices. We'll also delve into techniques and ideas for finding essential breaks to recharge and reveal the optimal places to be for maximum advantage.\r\n\r\nDiscover how introverts and extroverts can thrive in the world of tech conferences and user groups.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "a6ee49ed-a85d-43bd-8677-bced09824b2c",
            "name": "Nerando Johnson"
          },
          {
            "id": "25b4a764-0ab3-4a6b-b7b6-8e5f5d46dfc6",
            "name": "Glenn Renfro"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207651,
                "name": "Agile"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "539369",
        "title": "How To Make Your JavaScript Accessible Without Losing Your Sanity (Or Your Hair)",
        "description": "Accessibility is an important aspect of web development, ensuring that people with disabilities can access and use web applications. However, accessibility can often be an afterthought for developers.\r\n\r\nIn this talk, we will explore how JavaScript developers can build more accessible web applications and start by discussing specific techniques and tools that JavaScript developers can use to ensure their applications are more accessible.\r\n\r\nWe will cover topics such as basic accessibility, using semantic HTML and ARIA attributes, implementing keyboard accessibility, and testing for accessibility issues. We will also discuss how to ensure accessibility when working with popular JavaScript libraries and frameworks and the importance of designing for accessibility from the outset.\r\n\r\nBy the end of this talk, attendees will have a solid understanding of the principles of web accessibility and specific techniques and tools they can use to build more inclusive web applications with JavaScript.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "5a2864c6-5fc4-4ca3-bf60-839888286167",
            "name": "Todd Libby"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537726",
        "title": "Introducing Spring AI",
        "description": "By now, you've no doubt noticed that Generative AI is making waves across many industries. In between all of the hype and doubt, there are several use cases for Generative AI in many software projects. Whether it be as simple as building a live chat to help your users or using AI to analyze data and provide recommendations, Generative AI is becoming a key piece of software architecture.\r\n\r\nSo how can you implement Generative AI in your projects? Let me introduce you to Spring AI.\r\n\r\nFor over two decades, the Spring Framework and its immense portfolio of projects has been making complex problems easy for Java developers. And now with the new Spring AI project, adding Generative AI to your Spring Boot projects couldn't be easier! Spring AI brings an AI client and templated prompting that handles all of the ceremony necessary to communicate with common AI APIs (such as OpenAI and Azure OpenAI). And with Spring Boot auto-configuration, you'll be able to get straight to the point of asking questions and getting answers your application needs.\r\n\r\nIn this session, we'll consider a handful of use cases for Generative AI and see how to implement them with Spring AI. We'll start simple, then build up to some more advanced uses of Spring AI that employ your application's own data when generating answers.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "6baa8ae0-aa56-42e3-8ab8-6c511a55c2bc",
            "name": "Craig Walls"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537737",
        "title": "Jakarta EE 11: Going Beyond the Era of Java EE",
        "description": "Since its introduction in 2018 as Jakarta EE, the platform has evolved from: Jakarta EE 8, an open-source version of Java EE 8; to Jakarta EE 9, the \"big bang\" release; to Jakarta EE 10 that introduced the Core Profile.\r\n\r\nJakarta EE 11, scheduled for a GA release in 1Q2024, will introduce new specifications, provide updated specifications, and set the baseline to Java 21, the latest LTS release.\r\n\r\nThis presentation will provide a brief history of JavaEE/Jakarta EE and a review of new and updated specifications with code examples.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "9820a802-240a-4fc0-9541-36ff1c2f760b",
            "name": "Michael Redlich"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 219279,
                "name": "JakartaEE"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557712",
        "title": "Jakarta EE! The future of enterprise application behind the myths.",
        "description": "Most enterprises continue running their Application in a JEE Server. We realize that there are among of code that is not evolving. Throughout this talk, we are showing you by example some real-world experiences of moving forward Applications running JEE 5 & 7 to Jakarta EE 10. At the end of this session, you are going to understand the pitfalls and put away the concerns of updating and evolving your enterprise applications.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "9b9cb6b1-b132-4f4f-8bbc-155e31958220",
            "name": "Alberto Salazar"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 219279,
                "name": "JakartaEE"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557741",
        "title": "Java automation for yesterday, today and tomorrow",
        "description": "Consistency, repeatability and simplicity are core tenants to being successful in today’s face paced, highly competitive industry. Infrastructure and development teams configuring systems that run Java workloads as well as the workloads themselves can achieve these principles through the use of automation.\r\n\r\nAnsible Middleware is an Open Source Project that leverages the power of Ansible automation to provide solutions for infrastructure teams managing Java based application servers and systems as well as integrations for developers running Java frameworks. Concerns shared among these groups include Middleware as GitOps, Compliance as Code, the underlying infrastructure, the application server configuration, patching, upgrades and integration between each of the systems, to name a few.\r\n\r\nRegardless if the systems and workloads were developed using legacy components or the next generation technologies, utilize a suite of tools that automates your Java based estate. \r\n\r\nIn this session, attendees will:\r\n* Learn the importance of automation at scale\r\n*Understand the tools and solutions provided by the Ansible Middleware project\r\n* Automate Java application servers regardless of their location: on premise, in the cloud, or at the edge\r\n* See how easy it is to build and deploy Quarkus based applications using automation\r\n* Leverage a suite of assets that development and operations teams can leverage in their own environment\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "6aa1e85f-84ea-4607-9f9e-2275e78f494b",
            "name": "Andrew Block"
          },
          {
            "id": "0df0c22e-c340-4414-aa16-12623cd9b948",
            "name": "Harsha Cherukuri"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207664,
                "name": "Unobtanium"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "548139",
        "title": "Java meets TypeScript: learn to build full-stack web apps with Spring Boot and React",
        "description": "As Java developers, we know the benefits of type-safety when building apps. The problem? Usually, that type-safety ends when we leave the server. What if it didn't have to be that way?\r\n\r\nIn this presentation, you'll learn how to build a full-stack reactive web app through live code examples. We'll use Spring Boot and Java on the backend and React with TypeScript on the frontend, connecting the two with the new Hilla framework from Vaadin.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "6c93de4e-0f8c-45bd-b76b-ba868aa81ca7",
            "name": "Marcus Hellberg"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556719",
        "title": "Java, JavaFX, and Life on Jupiter’s Europa",
        "description": "NASA’s deep space Clipper mission will launch in 2024 and travel to Jupiter’s icy moon Europa searching for the conditions and evidence of organic life. The mission’s success hinges on innumerable technical trials, from evaluating spacecraft trajectories to prioritizing surface observation targets. To help the Europa Clipper team navigate these complex challenges, we developed a Java-based visualization, planning, and analysis tool, named Cadmus.\r\n\r\nThe planning and analysis of the Europa Clipper mission requires highly precise spatial geometries, as the spacecraft will be flying at a speed of kilometers per seconds, while targeting small features on the Europa surface. At nearly 1 billion kilometers away from Earth, precision in planning is paramount. For this, the Cadmus tool uses a combination of Java spatial geometry toolkits and JavaFX to display the precise positions of the spacecraft, planets, moons, stars, surface features, flyby paths, and many more. This effect must be both high performance and interactive so that scientists and engineers can quickly prioritize and plan upcoming observations. \r\n\r\nTo achieve this, we created an infrastructure in Java that allows us to responsively render and interact with maps and space views by combining JavaFX and AWT in a multi-threaded approach. This approach has been extremely successful, and now supports missions outside of Europa Clipper, analyzing spacecraft and data around Saturn, Venus, the Moon, and all the way back to Earth. This presentation will review the NASA Clipper use case, provide a live demo of the software while discussing code segments that are insightful or tricky for such an implementation.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "1c0d52b2-0edc-4419-917f-b10fbf1c0d54",
            "name": "Jordi Turner"
          },
          {
            "id": "98f13279-4870-419d-bc75-01444e9c3da5",
            "name": "Scott Turner"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556916",
        "title": "Java's New Powers: Hero or Villain in Your Code?",
        "description": "With Java’s six-month release cadence, new features and enhancements appear like superheroes, more frequently than ever before, promising to address our pain points. These Java features are indeed powerful, but their impact depends on how they are used and integrated into our code. A poorly executed implementation can quickly turn a superhero into a villain, undermining the potential benefits.\r\n\r\nJoin me in this live hands-on coding session where I’ll demonstrate the capabilities of Java's latest features and the way they are or could be implemented in a real-world project. Prepare to witness the battle between Java's incredible features and the forces of poor implementation. I’ll talk about multiple use cases with practical strategies and best practices for using Java's latest enhancements, ensuring they shine as true superheroes in your development projects.\r\n\r\nBy the end of this session, you'll learn tips and tricks to utilize Java's new powers like Virtual Threads, String Templates, Pattern Matching, Records, Text Blocks and many more. Join me for an exploration of how Java can be your ally in the battle against code chaos.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "16e1da1a-8902-415a-badf-f021d7b888ec",
            "name": "Mala Gupta"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "549542",
        "title": "JUnit 5's Best Features",
        "description": "The team that rewrote JUnit in version 5 did a fantastic job improving the platform while maintaining backward compatibility. Many Java developers don't realize how many new cool capabilities have been added to the framework since the initial 5.0 release.  This talk will cover topics like the set of useful functional interfaces available, how to do parameterized tests with various sources, lazy loading of error messages, and more.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "ecda0d84-be59-41c6-8983-b58cd5b3f93c",
            "name": "Kenneth Kousen"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557560",
        "title": "Just-in-time Compilation Isn’t Magic",
        "description": "Just-in-time Compilation Isn’t Magic\r\n\r\nFortunately for most Java developers the just-in-time compiler just works and appears to work by magic.  And yet sometimes, we find ourselves facing a performance problem, so what do we when the magic stops?\r\n\r\nIn this talk, we’ll learn a few key concepts behind the magic of modern optimizing compilers: intrinsics, basic blocks, static single assignment, and inlining.  By the learning these concepts, you’ll learn to save time not trying to optimize the things that the compiler can already do for you and focus on things that matter most.\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "d0e56066-fb6c-4d1f-a65c-2c7b71ede47c",
            "name": "Douglas Hawkins"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537960",
        "title": "JVM Ergonomics Profiles: Enhancing Resource Consumption and Performance in Dedicated Environments",
        "description": "Ergonomics Profiles is a new Java Virtual Machine (JVM) feature proposal aimed at improving resource utilization and performance in dedicated JVM environments, such as containers. The proposal outlines the motivation behind Ergonomics Profiles, highlighting the prevalent usage of dedicated resources in modern cloud-based JVM workloads. It addresses the limitations of default JVM ergonomics designed for shared environments and the resulting resource waste. The proposed solution includes the introduction of two profiles: \"shared\" for traditional environments and \"dedicated\" for systems with dedicated resources. The dedicated profile offers optimized heuristics for maximizing resource consumption, including dynamic heap size allocation, enhanced garbage collector selection, and native memory estimation. The proposal also presents a new flag for profile selection and provides APIs for programmatically identifying the selected profile. By incorporating Ergonomics Profiles, JVMs can better adapt to dedicated environments, reduce resource waste, and increase overall chances of better performance, resulting in more efficient and scalable Java applications.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "e0b15676-adb2-4ea7-bb68-ca1af864a14f",
            "name": "Bruno Borges"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557675",
        "title": "Keeping your build tool updated in a multi repository world: a Netflix tale",
        "description": "Gradle is an open-source build automation tool focused on flexibility, build reproducibility and performance. Over the years, this tool has evolved and introduced new concepts and features around dependency management, publication and other aspects on build and release of artifacts for the Java platform.\r\n\r\nKeeping up to date with all these features across several projects can be challenging. How do you make sure that all your projects can be upgraded to the latest version of Gradle? What if you have thousands of projects and hundreds of engineers? How can you abstract common tasks for them and make sure that new releases work as expected?\r\n\r\nAt Netflix, we built Nebula, a collection of Gradle plugins that helps engineers remove boilerplate in Gradle build files, and makes building software the Netflix way easy. This reduces the cognitive load on developers, allowing them to focus on writing code.\r\n\r\nIn this talk, I’ll share with you our philosophy on how to build JVM artifacts and the pieces that help us boost the productivity of engineers at Netflix. I’ll talk about:\r\n- What is Nebula\r\n- What are the common problems we face and try to solve\r\n- How we distribute it to every JVM engineer\r\n- How we ensure that Nebula/Gradle changes do not break builds so we can ship new features with confidence at Netflix",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "ae7a5785-c916-448e-bf74-7faa54adae66",
            "name": "Roberto Perez Alcolea"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "555595",
        "title": "Keeping Your Java Hot by Solving the JVM Warmup Problem",
        "description": "Java bytecodes and class files deliver on the original vision of “write once, run anywhere”.  Using a Just-in-Time (JIT) compiler allows JVM-based applications to compile only the code that’s being used frequently and optimise it precisely for how it is being used.  Using techniques like speculative optimisation can often deliver better performance than static, Ahead-of-Time (AOT) compiled code.\r\n\r\nHowever, this flexibility and performance comes at a cost.  Each time the JVM starts an application, it must perform the same analysis to find hot spots of code and compile them.  This is referred to as the application warmup time.\r\n\r\nIn this session, we’ll look at several approaches to how this problem can be alleviated or even eliminated.  Specifically:\r\n\r\n•\tGenerating a JIT compiler profile of a running, warmed-up application that can be reused when the same application is restarted, eliminating the need for much of the JIT compilation.\r\n•\tDecoupling the JIT compiler from the JVM for a Cloud environment.  Providing a centralised JIT-as-a-Service allows caching of compiled code and offloading the compilation work when new code must be compiled.\r\n•\tCreating a checkpoint of a running application.  This includes all application state (heap, stack, etc.) in addition to the JIT-compiled code.  Project CRaC will be used as an example.\r\n\r\nAt the end of the session, you’ll be all set to keep your Java hot!\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "709043d1-5754-4459-a8d5-6dd2f5619874",
            "name": "Simon Ritter"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537983",
        "title": "Know Your Ingredients: Security Starts With the Source",
        "description": "One of the most neglected parts of application security is the ingredients that go into developing software. Over 80 percent of code used in enterprise applications comes from open source dependencies, but how much attention goes towards the provenance and security of those packages. And in the pursuit of accelerated software development, developers are leveraging more and more libraries and also code “created” by generative AI algorithms, so how do you prevent defects or malicious payloads from compromising your security?\r\n\r\nThis is analogous to a restaurant where you invest in modern decor, professional chefs, and world class service. But if you don’t get fresh, quality ingredients delivered daily, the taste and hygiene of the food will suffer. Securing the software supply chain is a huge undertaking for the entire tech industry, and we will talk about some of the ongoing efforts by open source projects, foundations, and corporations to help us all know our ingredients.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "0793b99f-1282-4674-9d21-f88e30c8232e",
            "name": "Stephen Chin"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557220",
        "title": "Knowledge Management for the Technically Inclined",
        "description": "Knowledge sharing and creation is foundational to technical professionals' work, and yet is one of the most overlooked areas of modern business. When you cannot find the information you need, or it is hard to understand, your productivity and your end customer are going to be affected.\r\n\r\nYou can use effective knowledge management principles and techniques to get your time back for your important work. Discover:\r\n- techniques for organising your personal, team, and organisation knowledge so it can be found\r\n- how to present information so it can be more easily consumed by the reader\r\n- how to work together with your peers to improve your documentation\r\n- how to align your documentation to your audience to optimise communication\r\n\r\nLearn how to optimise the knowledge and understanding that underpins what you do.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "1b56e49d-1702-4a54-9cf7-433c38632ebe",
            "name": "Jacqui Read"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551553",
        "title": "Kubernetes Demystified",
        "description": "Have you heard about Kubernetes? Of course you have, is that thing that was created by Google to orchestrate containers. You might have heard some of its features, like auto-scaling, load balancing, zero downtime version releases, etc. And also, you might have heard the new jargon that comes with it. \r\n\r\nPods, nodes, replicasets, deployments, statefulsets, netpols, services, namespaces, kubectl????\r\n\r\nIf you are wondering what all those words mean, you are not alone! (and you probably need to join me in this talk)\r\n\r\nIn this session, we'll start with a quick introduction to Kubernetes and the problems that it is trying to solve. We'll demystify terms like pods, deployments, services, and more. You'll gain the knowledge you need to navigate the Kubernetes landscape confidently, making sense of the buzzwords that have left you scratching your head.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "90d4149a-7993-407f-a350-a0d7a8a04440",
            "name": "Orlando Valdez"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207654,
                "name": "Cloud Technology"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "539216",
        "title": "Loom is more than virtual threads: Structured Concurrency and Scoped Values",
        "description": "Most of the talk about Project Loom as been about JEP 425: Virtual Threads. That's great because virtual threads are incredibly useful and will revolutionize how we write high-throughput applications. But did you know there are two more JEPs associated with Project Loom that are also very useful? First we'll learn about JEP 428: Structured Concurrency and how it will simplify multithreaded programming on the JVM. Next, we'll learn about JEP 429: Scoped Values which aims to solve some problems that ThreadLocals have had since their introduction way back in Java 1.2!  Come to this talk and we'll learn why these projects are useful additions to the JVM, and write some code to illustrate where you'll be able to use them effectively. ",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "172a6669-38c5-46ec-b262-3290e8aa41e3",
            "name": "Todd Ginsberg"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551714",
        "title": "Mastering Modern Concurrency in Java - A Comprehensive Deep Dive with Virtual Threads",
        "description": "Traditional methods of handling multiple tasks in Java have limitations, such as resource-heavy threads and complex code. These limitations can hinder performance and development speed in today's world, where fast, efficient applications are a must.\r\n\r\n\r\nThis session aims to introduce and demystify the latest Java 21 concurrency features—Virtual Threads, Structured Concurrency, Scoped Values. These tools can help you build faster, more efficient applications while keeping your code clean and manageable.\r\n\r\n\r\nWe'll deep-dive into each of these four topics through a blend of theory and practical code examples. You'll learn how to:\r\n- Utilize Virtual Threads for efficient multitasking\r\n- Implement Structured Concurrency for more readable and maintainable code\r\n- Leverage Scoped Values for smarter data sharing\r\n- Understand the continued relevance of Reactive Java in this new landscape\r\n\r\nWhether you're a seasoned developer or an architect, this session will equip you with the knowledge and skills to implement these modern features effectively. \r\n\r\nJoin me and take the first step towards mastering the future of Java concurrency!",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "79e95ec4-23ec-48ec-9046-98d3e1776283",
            "name": "Bazlur Rahman"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207666,
                "name": "workshop"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "547698",
        "title": "Methodically Migrating from JavaScript to TypeScript",
        "description": "It's no secret that TypeScript is all the rage in modern web development. With all of the scaffolding tools that exist to support starting a new project with TypeScript, it's never been easier to try it out. However, it can feel very overwhelming to think about the necessary steps to migrate your existing JavaScript project to TypeScript. In this talk we'll explore progressive enhancements you can make to move your JavaScript project to TypeScript without disrupting your team's productivity.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "27a63fc1-2981-4a83-8f13-fa986f36de8d",
            "name": "Sean McQuaid"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "540558",
        "title": "ML in Java, YES it's possible!",
        "description": "When you think about building and/or deploying machine learning models, Java is not within the top 3 languages that we generally think of. Nonetheless Java has a strong community, with millions of developers using it as their main language.\r\nWith the AI buzz spiking in the past month, All developers, and especially Java developers, need to understand how to build and run apps that use ML. In this session we are going to explore what are our options, as java developers, to build, save and run machine learning models.We are also going to discuss and compare the most 3 popular frameworks (Deeplearning4J, djl and Tribuo), along with a real world example to understand capabilities and tradeoffs of each framework. We will also briefly cover JSR381, an open-source, Java-friendly API for ML, specifically visual recognition",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "df2764ce-246c-406d-8cba-c3515e254253",
            "name": "Mohammed Aboullaite"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557568",
        "title": "Modern Testing Tools for Java Developers",
        "description": "New versions of the API framework appear, adding the last trending and here we go again: changing our code to adopt these new things. How awesome it is! We are improving!\r\n\r\nHow about one of the most important and, sometimes, missed things: quality! How the quality evolves within the adoption of new versions of development frameworks and libraries?\r\n\r\nThis talk will show you 5 libraries you can use, as a Java Developer, to improve the application quality with real-world examples.\r\n\r\nAssertJ will give you infinity assertion possibilities compared to JUnit internals and Hamcrest matches, enabling you to easily use any kind of assertion, even creating your own.\r\n\r\nYou will learn how to use these tools with real-world examples!\r\n\r\nPiTest will increase, even more, the coverage of your tests by applying the mutation testing technique and creating bullet-proof unit tests.\r\n\r\nRestAssured will take your API tests to the next level where, using it as a \"hard user\", can ease the test creation based on an OpenAPI specification.\r\n\r\nAwaitability will solve one of the biggest problems in the API tests: asynchronous calls/messages (mainly in a messaging system). We will be able to wait for the request to be completed to assert any result.\r\n\r\nWiremock will give you the ability not only restricted as a mock solution for your unit and integration test but as a service virtualization tool solving common problems in an integrated environment.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f914323b-f3ba-4de7-9069-28974d1c9137",
            "name": "Elias Nogueira"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557446",
        "title": "More tales from the Dark Side: How AI is the bad guys new friend",
        "description": "The bad guys are clever, motivated, ruthless and armed with AI. What was scary before is now terrifying.  So many new ways of tricking you: Learn about sneaky device attacks, amazing attacks-by-post , AI's imitating your coworkers,  AI being corrupted, unbelievable physical choreography manipulations,  open source taker overs  and more!\r\n\r\nIn this talk learn a little about the scale of the challenge developers still face from assaults on our systems. Be prepared to be appalled and frightened. Fainting is not allowed.\r\n\r\nDiscover how to fight back and see how you can change your behaviour and your code to defend against these attacks.\r\n\r\nYour destiny is clear - it’s time to be come a Cyber Defender",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "7a6d377f-3ce1-4b32-9014-c70c87022fd0",
            "name": "Steve Poole"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557699",
        "title": "Not a Kubernetes fan? The state of PaaS in 2024",
        "description": "Kubernetes won the containers orchestration war. But has it made deploying your apps easier?\r\nLet's explore some of Kubernetes extensive app developer tooling, but mainly what the PaaS space looks like in 2024; 17 years after Heroku made it popular.\r\nIs Heroku still around? What about Cloud Foundry? \r\nAnd what are those new comers (fly.io, repl.it) worth?\r\nDid the Cloud giants replace them all?",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "781d5601-1f81-4d31-940c-e54f12b2de6b",
            "name": "Anthony Dahanne"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207653,
                "name": "Cloud Infrastructure"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556765",
        "title": "Passkeys...Yes Please!",
        "description": "\r\nDo you or someone you know reuse passwords? How much entropy do your passwords have? Have you selected passwords that are truly random? Do you and your entire family use a password manager? In 2022, over 24 billion passwords were exposed by hackers. With passwords, attackers can steal your identity, money, and leverage your computing resources to attack other users.\r\n\r\nPasswords are a way of life, but do they have to be? WebAuthn is probably best known for its ability to provide multi factor authentication, but it has more recently gained attention under the name Passkeys as a replacement for passwords.\r\n\r\nIn this session, Rob will teach you all there is to know Passkeys. He will  also walk you through a demo Spring application that leverages Passkeys so you can see first hand what it takes to implement Passkeys in your applications.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "727026b3-6a06-41d7-803d-cc6df0a8802c",
            "name": "Rob Winch"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "547157",
        "title": "Preparing for the Java 21 cert and learning new features",
        "description": "Looking to learn about features in the language added after Java 17 in more detail? As programmers we are used to dealing with edge cases. But what about edge cases in the language? As certification book authors, we encounter lots of interesting and/or surprising behavior.  After a brief overview of the cert, we will explain these features and walk through lots of tricky questions. Come to this session and walk away with an increased awareness in these Java topics.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "6631e69f-25c4-47db-9fb2-08576a460048",
            "name": "Jeanne Boyarsky"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "539474",
        "title": "Product Centricity and Agility: Mega Powers combined",
        "description": "Abstract:\r\nIn software development two themes run rampant which are complementary yet distinct: Product Centricity and Agility. Even specialists of these areas might not be familiar with how they are different, what their divergent priorities are, and how to align when trying to decide on where to fall on the continuum between the two. Hear about how these Mega Powers can either work together or explode! Learn how organizations like Discover use dojos and academies to helps product leaders and agile coaches align to drive innovation and continuous improvement while staying true to product vision and organizational outcomes.\r\n\r\n\r\nDesired learning outcomes:\r\n\r\n1. Identify key characteristics of a product-centric approach and an agile (user-focused) approach.\r\n2. Evaluate a given product development scenario to assess where on the continuum of product-centricity and agility your team must fall to achieve desired outcomes.\r\nLearn to formulate recommendations for improving a product development strategy by the incorporating the beneficial elements of both product centricity and agility.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "2c2f23ea-2165-4bb3-b1a8-2080da65ff87",
            "name": "Robert Clawson"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207651,
                "name": "Agile"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556894",
        "title": "Quarkus in the Cloud: Strategies for Teams and Topolgies",
        "description": "Java is a powerhouse of a language suitable for use in many environments, footprints, and form-factors. As we collectively learn more about how to write cloud applications, we're seeing more nuanced discussions about how we build applications: should we be using monoliths or microservices? Should I use cloud functions? What is a modular monolith and is it a good idea or not?  These choices require thoughtful architectural decisions and optimization strategies, not only at the code level but also in fostering effective teamwork. This talk delves deep into the architectural nuances and trade-offs essential for making informed decisions in these deployment paradigms.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f6c77911-6612-4b72-9832-63409826e785",
            "name": "Erin Schnabel"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207664,
                "name": "Unobtanium"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "555306",
        "title": "Reading code",
        "description": "As developers, we spend a lot of time learning to write code, while spending little to no time learning to read code. Meanwhile, we often spend more time reading code than actually writing it. Shouldn’t we be spending at least the same amount of time and effort improving this skill? Deliberate practice can help us get better at reading code. Learning how to better read and understand code, can in turn teach us what makes code readable. This might even help us to write code that is easier to read.\r\n\r\nIn this talk we will discuss the benefits of deliberately practicing reading code in a code reading club or session without an IDE, as well as common strategies to navigate a new codebase and familiarise ourselves with the code using the IDE.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "9f1e9a11-4022-412d-929c-d80ee4f5d19f",
            "name": "Marit van Dijk"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "555341",
        "title": "Refactoring AF (After Fowler): Some Large Refactoring Patterns",
        "description": "Martin Fowler’s Refactoring: Improving the Design of Existing Code was first published in 1999. What have we learned since then about refactoring? What should we, as professional software developers, know before deciding to do a refactor on a legacy codebase? What is the thought process we need to apply when choosing a new design for existing code? This talk will delve into these questions with examples and humor.\r\n\r\nThe audience for this session is software developers and the people that interface with them (product owners, scrum masters, development managers) who need to know the value of this important and often neglected technical practice.\r\n\r\nAt the end of the session, the attendee will be able to plan a refactoring effort on legacy codebases, apply refactoring techniques beyond those listed in Fowler, and recognize accidental code complexity in large codebases.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "83fd871a-3bbe-4d41-92a4-9443e7c66c5f",
            "name": "Aaron McClennen"
          },
          {
            "id": "eaa23bbd-1207-432d-8c52-eed0035f0ddf",
            "name": "M. Jeff Wilson"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207651,
                "name": "Agile"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "560890",
        "title": "Reviving the Java Community: Insights from JUG Leaders Worldwide",
        "description": "In recent years, the Java Community has faced somewhat of a paradox. While Java technology itself has grown and the number of online resources has skyrocketed, local Java User Groups (JUGs) have seen disruptions, with in-person meetings and activities coming to a halt, participation dropping, and even leaders losing interest. In this interactive session, we'll explore strategies to revive the community's spirit. So we can all embrace and celebrate Java's technical advancements.\r\n\r\nJoin us for an open conversation based on in-depth discussions with JUG leaders from around the world. We'll discuss their experiences, the challenges they've encountered, and the innovative solutions they've adopted. As we come together as a community, we'll address important questions: What role do leaders and organizations play in this revival? How can we collectively reenergize our local communities and celebrate the ongoing evolution of the Java ecosystem? This presentation aims to inspire action and motivate us all to revive this community we love.\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "1595afca-83d0-4893-afa1-a6b8d832aee5",
            "name": "Bruno Souza"
          },
          {
            "id": "058c3cdc-0607-4437-81bb-07a1aed5d05c",
            "name": "Elder Moraes"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207663,
                "name": "JUG Leaders Summit"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "568379",
        "title": "Scalable Machine Learning with PyTorch,  Kubeflow and Kubernetes",
        "description": "In the dynamic world of machine learning, data scientists and engineers face a constant challenge to design, train, and deploy models at scale while maintaining flexibility and reproducibility. PyTorch, a popular deep learning framework, Kubeflow, an advanced machine learning platform built on Kubernetes, and Kubernetes, a leading container orchestration system, have emerged as a triumphant trio to tackle these complex demands.\r\nWith Kubeflow, data teams can effortlessly manage distributed training, hyperparameter tuning, and model serving, leveraging the scalability and fault tolerance of Kubernetes.\r\nThis talk will explore the seamless integration of PyTorch with Kubeflow over Kubernetes orchestration platform to efficiently design and train models on any scale. \r\n\r\nTo begin, we will provide an overview of PyTorch, highlighting its strengths in building dynamic and efficient deep learning models.\r\nNext, we will delve into Kubeflow's core capabilities, elucidating how it extends Kubernetes to orchestrate end-to-end machine learning workflows.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "21924ec2-96d9-4b4a-b2c8-99dd2efb77a7",
            "name": "Mo Haghighi"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207673,
                "name": "Artificial Intelligence"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "555434",
        "title": "Simple Ways to Make Webhook Security Better",
        "description": "Webhooks are a simple and powerful way for services to notify each other that something interesting has happened. So much so that it became the most popular mechanism for communicating events. While webhooks give us power and flexibility, they rely heavily on the listener to enforce security. In this session, we will learn the most common, interesting, and challenging patterns across 100+ webhook implementations, and learn some simple ways to make webhook security better (for providers and consumers).",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f0f1fa39-eb24-4ab6-866c-b8645975bd75",
            "name": "Scott McAllister"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557603",
        "title": "Sociotechnical Platform Engineering",
        "description": "devOps practices help reduce friction to production for technologists. Once an application has user traffic, user experience should become a priority, but at what cost?\r\n\r\nThis talk will connect human centered devOps & SRE practices across a value stream to explore how platforms balance developer experience against production stability over time, and how process dependencies factor into overall platform success. \r\n\r\nthis talk will Explore:\r\n- How pipelines are value streams\r\n- A general-purpose value stream map for platforms\r\n- Dependency (wardley) maps for platform processes\r\n- Aligning SLIs, SLOs, & SLAs across our platform VSM\r\n- Establishing Error Budgets\r\n- Chaos Engineering & Complexity Science\r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "0494255d-10a1-4ec1-8c00-b0881c434931",
            "name": "Chris Corriere"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556271",
        "title": "Spring Boot 3 Workshop",
        "description": "Spring Boot 3 is the new major revision of Spring Boot. In this workshop, you will learn the fundamentals of the new features available in the Spring portfolio and also application observability mainly with Micrometer. We will cover the latest developments in Spring Framework 6, Spring Boot 3, and Micrometer. You will apply these fundamentals to realistic scenarios in sample applications where having observability is crucial. You will learn how to Migrate from Boot 2.x to 3, what new features are available, how to use the new AOT and GraalVM native-image support, how to effectively handle errors, how to integrate applications over HTTP via the new Interface Clients, how to avoid common issues, how to make these apps observable, what observability signals to watch, and how to integrate metrics with distributed tracing and logs.\r\nThis workshop is for people who want to learn about Spring Boot 3, Spring Framework 6 and observability. What new tools to use and how to use them with the applications they write so that they can face the cruel world of production.\r\n\r\nPrerequisites:\r\n- Very basic Spring Boot knowledge (how to create beans and HTTP endpoints), you can learn these from our online guides quickly, e.g.: https://spring.io/guides/gs/rest-service/\r\n- Docker\r\n- Java 17 (or higher) installed\r\n- A Java IDE",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "8f517aca-8293-4e1f-9360-0ce676531421",
            "name": "Jonatan Ivanov"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207666,
                "name": "workshop"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551464",
        "title": "Spring off the HTTP High Dive into an Optimized Connection Pool",
        "description": "In this session, I will explore different Spring libraries used for HTTP calls like RestTemplate, WebClient, and RestClient-which is a new feature in Spring Framework 6.1.  I’ll then dive into the multitude of settings that are available along with what defaults are present when nothing is given, focusing in on connection pool settings.  I’ll use observability tools and logs to show what’s happening under the covers and showcase some gotchas for things like TTL settings and DNS caching. ",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "c5adff32-ef90-48f3-b1ef-14fcd2d9132c",
            "name": "John Coyne"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "545764",
        "title": "Supersonic, Subatomic GitHub",
        "description": "You've seen GitHub Actions, but did you know about GitHub Apps? \"GitHub Apps are tools that extend GitHub's functionality.\" A GitHub app lets you interact with GitHub -- or a third party system, or both! -- when certain things happen in a repository. Things like someone pushing to the repository, creating a pull request or issue, commenting on or editing pull requests, issues, etc. The official docs show you how to write an App using JavaScript, which is fine, but then you have to use JavaScript! \r\n\r\nIn this presentation, we'll look at how we can use our Java and Quarkus experience to write an application. We'll register the application with GitHub, set up the project for the application, and react to various events. At the end, we'll have a working GitHub application, written in Java (or Kotlin!) that is supersonic, subatomic awesomeness.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "72b630b0-9ef2-4e5f-86f2-ba2f357df49f",
            "name": "Jason Lee"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207664,
                "name": "Unobtanium"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "538024",
        "title": "The Art of Vulnerability Disclosure",
        "description": "Properly disclosing a vulnerability you found on a website, open source project, or app is not an easy task, especially not the first time. There are a lot of things to pay attention to and that can go wrong. But if done properly, it can be very rewarding, as most companies are very grateful. Whether you want to learn how to disclose your first vulnerability in the easiest way possible, or you want to hear about best practices and suggestions on what to do when things do not go as planned, this talk is for you.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "2f4018fc-6f1a-484c-9297-383fb1a5c4ae",
            "name": "François Martin"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556857",
        "title": "The Death Star and the ultimate vulnerability",
        "description": "The Death Star from Star Wars was an impressive though fictional feat of engineering, but it had a fatal flaw that was exploited by the rebels. Similarly, modern applications are at risk due to the many open-source dependencies used worldwide that can contain vulnerabilities. Some are just mistakes, and others, like that iconic exhaust port, were deliberately created. \r\n\r\nManaging these components and ensuring their security is crucial to prevent successful attacks. This session will take you to a galaxy far far away, to look at what went wrong in the Empire's supply chain to cause such a vulnerability to be introduced. By understanding the risks and using the right tools, we can avoid a catastrophe like the Death Star’s destruction and put a stop to any rebel scum.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "eb8e3906-8c75-4876-9fe1-0aca5db8ef40",
            "name": "Jamie Coleman"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557363",
        "title": "The future of Java runs on Arm",
        "description": "Java and Arm have always gone together, from the very early days all the way through the smartphone revolution. Now with Arm64 CPUs taking over the cloud and datacenter, keeping Java performant on this architecture is more important than ever. In this talk we will look at the various optimizations being made to Core Java, JITs and the rest of the Java Platform to take advantage of advances in the Arm architecture.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "41866ef7-180d-462a-93c1-fbcaa07e3db0",
            "name": "Michael Hall"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "554819",
        "title": "The Next Frontier in Open Source Java Compilers: Just-In-Time Compilation as a Service",
        "description": "For Java developers, the Just-In-Time (JIT) compiler is key to improved performance. However, in a container world, the performance gains are often negated due to CPU and memory consumption constraints. To help solve this issue, the Eclipse OpenJ9 JVM provides JITServer technology, which separates the JIT compiler from the application.\r\n\r\nJITServer allows the user to employ much smaller containers enabling a higher density of applications, resulting in cost savings for end-users and/or cloud providers. Because the CPU and memory surges due to JIT compilation are eliminated, the user has a much easier task of provisioning resources for his/her application. Additional advantages include: faster ramp-up time, better control over resources devoted to compilation, increased reliability (JIT compiler bugs no longer crash the application) and amortization of compilation costs across many application instances.\r\n\r\nWe will dig into JITServer technology, showing the challenges of implementation, detailing its strengths and weaknesses and illustrating its performance characteristics. For the cloud audience we will show how it can be deployed in containers, demonstrate its advantages compared to a traditional JIT compilation technique and offer practical recommendations about when to use this technology.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "b2f9d832-c42b-452b-bbb6-f642cd43ffea",
            "name": "Rich Hagarty"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557537",
        "title": "The OffHeap Podcast. Devnexus Edition",
        "description": "Coming back for another year, the OffHeap podcast have been a staple of DevNexus. Bringing you interesting conversations, trivia, and fun facts around our favorite JVM language we promise that this session will be another one you are NOT going to forget. Take the time to meet the faces behind the (most awesome) Java podcast out there!",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "4d4ac30a-3cf4-4c64-99d4-8261e8e966ad",
            "name": "Freddy Guime"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557480",
        "title": "The Platform Engineer Playbook - 5 Ways to Container Security",
        "description": "The infamous Log4Shell vulnerability took the software community by surprise two years ago; it was a perfect storm of the massively popular open-source library with a vulnerability that was fairly trivial to attack. Will there be another massive vulnerability to deal with this year? It’s always possible, but there are things you can do to protect your application.\r\n\r\nAs we address additional layers in our defense-in-depth model, and with many containers requiring scale, an advanced application network with a wide array of security features is required. How do we ensure the right policies are in place to allow communication? What mechanisms exist to ensure that payloads in our network cannot be deciphered or replayed? How do we leverage identity to attest containers and their intent?\r\n\r\nFrom a developer’s shell to a platform engineer moving to a runtime in production, there are many tools and practices available to mitigate and detect would-be attackers and make their lives harder.\r\n\r\nThis session will include a live demo of the Log4Shell remote code exploit (RCE) and effective techniques to defend against vulnerabilities like it such as:\r\n- Code & container image scanning\r\n- Best practices for container runtime configuration\r\n- Policy enforcement in Kubernetes\r\n- Container authentication & authorization\r\n- Encryption & identification for services\r\n\r\nJoin us and protect your organization from an attack on the next critical CVE and make it harder for attackers to leverage it against you!",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "d7100338-7ea1-4f10-84fe-758b7ecbe1e7",
            "name": "Marino Wijay"
          },
          {
            "id": "57813d70-680c-461a-a887-8cd6cf101a81",
            "name": "Eric Smalling"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207659,
                "name": "Security"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "549436",
        "title": "The Wild West…East, North and South: Multi-Region Java Apps in the Cloud",
        "description": "Cloud providers allow us to provision our application infrastructure in cloud regions and availability zones around the world. This makes it possible to build Java apps that serve user requests with low latency from nearly anywhere. However, only a few deploy application instances across several distant locations.\r\n\r\nThis hands-on session introduces you to the design patterns of multi-region Java applications in the cloud with a focus on latency and response time. We'll start with a traditional single-region configuration and then switch to a multi-region setting. In the end, we'll have a working prototype of an application that handles user traffic with low latency in North America, Europe, and Australia.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "13f2987c-b5e6-4a8e-a039-e97f93f20670",
            "name": "Denis Magda"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207654,
                "name": "Cloud Technology"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "553009",
        "title": "Thriving in the cloud: Going beyond the 12 factors",
        "description": "Enabling applications to really thrive (and not just survive) in cloud environments can be challenging. The original 12 factor app methodology helped to lay out some of the key characteristics needed for cloud-native applications... but... as our cloud infrastructure and tooling has progressed, so too have these factors.\r\nIn this session we'll dive into the extended and updated 15 factors needed to build cloud native applications that are able to thrive in this environment, and we'll take a look at open source technologies and tools that can help us achieve this.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "7c534296-8db5-4452-b17f-9249465ea914",
            "name": "Grace Jansen"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207652,
                "name": "Architecture"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "558007",
        "title": "To Java 22 and Beyond!",
        "description": "Java 21 has come and gone, and the Java release train continues with Java 22!\r\n\r\nStill, we will look over the key changes that have come to Java in recent releases, briefly discuss what has changed from 11-17, and take time to focus on changes in 17+. \r\n\r\nMany key changes have come to Java in recent releases; virtual threads, pattern matching, records, Generational ZGC, and more, understanding the goals of these changes can be key to understanding where Java is now and where it is going in the future!",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "6f426cb0-6261-4f79-b726-b7ffc3b028ff",
            "name": "Billy Korando"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537763",
        "title": "Trash Talk - Exploring the memory management in the JVM",
        "description": "In the realm of Java programming, understanding memory management and garbage collection mechanisms cannot only be helpful for optimizing performance and resource utilization but also in general will help you to use the right garbage collector for your application. This session will be about memory allocation, object lifecycle, and garbage collection strategies within the Java Virtual Machine (JVM). Attendees will gain insights into memory allocation strategies, object retention policies, and various garbage collection algorithms like generational and concurrent collection. So when you are interested in getting more knowledge about which garbage collector to use best for your application or about memory management in the JVM, this session is for you.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "71f3abf1-03cf-458b-b385-e10fd110e89a",
            "name": "Gerrit Grunwald"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557685",
        "title": "Troubleshooting, Monitoring and Profiling with Java Flight Recorder, Mission Control and Cryostat",
        "description": "Java Flight Recorder and JDK Mission Control enable continuous collection of low level,  detailed runtime information for incident analysis. JFR is included with the JDK, has a tiny footprint, and \r\n\r\nJava Flight Recorder is a profiling and event collection framework built into the JDK. \r\n\r\nJDK Mission Control contains a set of tools that enable detailed analysis of the data collected by Java Flight Recorder.\r\n\r\nCryotstat enables secure managemant of JFR recordings for containerized Java apps.\r\n\r\nIn this presentation, we will dive into Java Flight Recorder, Java Mission Control, and Cryostat.  You will leave knowing how start, stop, and visualize data about your Java applications running in and out of containers.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "943e1c6e-d2db-4829-b701-000eaac0f5cd",
            "name": "Jeremy Davis"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "547437",
        "title": "Unlocking Dramatic Savings: Optimize your App and Database Footprint with Serverless Java",
        "description": "In the dynamic world of cloud-native apps, efficient microservices are crucial. This talk introduces a groundbreaking blend of serverless computing. Serverless architecture simplify containerized app deployment and scaling, letting developers focus on coding, not infrastructure. EclipseStore is a high-performance, in-memory data platform. This combination offers: 1) Seamless Scalability: Dynamic microservice scaling with Serverless optimizes resource use, minimizes overhead. 2) Data Efficiency: EclipseStore's in-memory data processing boosts data access speed, reduces latency. 3) Cost Savings: serverless computing cuts infrastructure costs, eliminates server management. EclipseStore eliminates data storage costs.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f465d18e-ff85-47b9-9997-f00a602ac48d",
            "name": "Markus Kett"
          },
          {
            "id": "c53d0ee3-4ee1-4a19-ac0a-26a38a4c43af",
            "name": "Richard Fichtner"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207653,
                "name": "Cloud Infrastructure"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "541686",
        "title": "Using AI to Deploy Java apps to Kubernetes",
        "description": "Developer teams are constantly under pressure to deliver new features and functionality without impacting core applications, often using new and unfamiliar features and environments. In this session we’ll show how to use AI to automate deployments to Kubernetes reliably and securely using GitHub actions.  Highlights will include using AI to create Kubernetes deployment manifests and GitHub actions, AB Testing, blue-green deployments, and GitHub repo features for Dev/Test environments,  plus  practical container orchestration for Kubernetes in production.  ",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f412fe67-9886-458b-ab9d-8e7f578bd742",
            "name": "Brian Benz"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207654,
                "name": "Cloud Technology"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557724",
        "title": "void main()",
        "description": "There are many changes in the Java language aiming to reduce boilerplate and make the language more straightforward and attractive to new developers. This talk will cover recent features by live refactoring an application to the newest Java version. You will learn the benefits and applicability of new features while writing a more readable code.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "8983937d-7fc9-4cb4-bdcf-ce009d874531",
            "name": "Rodrigo Graciano"
          },
          {
            "id": "ab1b8b69-f449-4df9-b391-243a391b9d01",
            "name": "Chandra Guntur"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "537919",
        "title": "Vue for React Developers",
        "description": "React is one of the most popular front end frameworks... but within the React community there are several misconceptions about Vue. Let's go through and convert a React component into a Vue component. The results might surprise a lot of React developers!",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "5c386803-b673-4259-a6ce-d85e1fd0a016",
            "name": "Alex Riviere"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551498",
        "title": "Weaving Spring Cloud Gateway on Loom",
        "description": "We will provide a brief history of API gateways in Spring Cloud, including Zuul and why we built Spring Cloud Gateway to replace it. Then we will give a short primer on how the gateway routes and filters requests. We will then introduce how Spring Cloud Gateway can work in servlet containers using virtual threads on Java 21. We will compare and contrast this new functionality to the original WebFlux-based Spring Cloud Gateway.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "bdcf9fac-1a10-416b-9dc9-be50b718e9af",
            "name": "Spencer Gibb"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557266",
        "title": "What is Looming in Java",
        "description": "In the evolving landscape of software development, Java continues to be a stalwart choice for building reliable, scalable, and performant applications. The language and its ecosystem have evolved, incorporating modern paradigms and tools that cater specifically to the needs of high-scale applications. In JDK 21, java released Virtual Thread, which is known as Project Loom.\r\n\r\nProject Loom introduces lightweight and efficient virtual threads called fibers, massively increasing resource efficiency while preserving the same simple thread abstraction for developers. In this talk we will introduce how Fibers can reduce the effort of developing and managing high throughput applications.  We’ll take a quick peak at asynchronous coding styles, and then look at how Loom fits in today’s Java applications.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f7d03f66-8402-4926-ba4c-aade6a3f7817",
            "name": "Medha Chakraborty"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "559338",
        "title": "What the Heck are Server Sent Events?",
        "description": "Web applications frequently need to open a channel of communication with a server to get real-time updates. This is often done using two-way communication via WebSockets, but they can be complex to implement and, in many cases, are overkill. Server Sent Events (SSEs) offer an easy-to-implement alternative for many common use cases where an application only needs to receive updates.\r\n\r\nIn this session, we'll explore what the SSE spec is and how to implement it in a web application using JavaScript. We'll also take a quick look at a number of open source libraries LaunchDarkly maintains for implementing SSEs in Python, .NET, Go and more for server-to-server SSEs.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "b67a2f49-17ea-4918-b1c4-56f997b6a097",
            "name": "Brian Rinaldi"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207661,
                "name": "Web and Front-end"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557746",
        "title": "What Time Is It, Anyway? A Practical Guide To Using Dates And Times Correctly In Java",
        "description": "The most poorly understood and incorrectly used APIs in Java that I have seen in my years as a consultant at multiple companies is the Java Date-Time APIs. Even though the APIs were introduced 10 years ago in Java 8, I still see programmers using the older Date class, I've seen horrific misuse of the Java 8 Date Time APIs, and I have had to correct issues with both production code and test code due to fundamental understandings of the APIs. This presentation gives a crash course into the proper use of the Java Date-Time APIs, why they are needed, and how (and when) to properly apply them.\r\n\r\nAttendees will learn the basics of how to properly specify a date and time in Java. They will learn when to use local date/times and when to use zoned date/times. They will be introduced to ISO 8601 and see how to properly parse and format dates in a thread safe manner.   The use of ZoneIds and OffsetDateTimes will be explained. Attendees will learn to use the Period and Duration classes to  calculate the difference between two dates or times. Finally, some pointers will be given on properly using dates and times in unit tests.\r\n\r\nThe goal for this presentation is for attendees to be able to confidently and correctly use dates and times in Java instead of blindly copying and pasting code from the Internet.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "b765d60f-4717-4116-b9f2-002c8a10bd88",
            "name": "Kelly Morrison"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207655,
                "name": "Core Java"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "557373",
        "title": "Wiring Cloud Native applications for local development",
        "description": "Despite the quality of modern cloud-native tools, the user experience for the inner and outer loops are still radically different, which introduces friction and slows down developer productivity. \r\n\r\nDevelopment setups are application-centric, while production environments deal with deployments and tools required for operations teams to keep applications up and running. In this session, we explore tools to simplify both sides to improve developer productivity by following a platform engineering and polyglot approach. \r\n\r\nThis session demonstrates and provides hands-on experience on:\r\nHow to enable developers with standard application-level APIs to solve common distributed application challenges by using Dapr.\r\nHow to equip developers and product managers with consistent and polyglot feature flags with OpenFeature.\r\nAnd how to develop locally with these tools, outside of a Kubernetes Cluster, by using Testcontainers. \r\n",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "3ef92880-b80a-4305-b75c-35650d1259c8",
            "name": "Oleg Šelajev"
          },
          {
            "id": "f44f5308-1287-4e6c-8f48-6ed26ea9f9d3",
            "name": "Mauricio \"Salaboy\" Salatino"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207654,
                "name": "Cloud Technology"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "551437",
        "title": "Work Smarter, Not Harder with your AI Coding Companion",
        "description": "AI coding companion tools are growing in popularity, and many organizations are asking their development teams to use these tools with the goal of producing code faster and with fewer defects. However, large is the number of developers complaining about not being able to use them because \"they are not smart enough\" to understand their programming intentions. Anecdotally, this happens because, like a new developer during their first day in the job; there is no understanding of the existing code base, they have no clue about which frameworks are being used, and what is the required coding style.\r\n\r\nThis session will get into the weeds about how developers can explore the potential of AI coding companion tools by treating them as a new developer requiring proper onboarding. It will share day-to-day scenarios of developer problems and how these tools can help them if properly used. Examples will use Java, Visual Studio Code, and Amazon CodeWhisperer.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "f69133ba-5f6e-44e7-98e5-84b1dd108991",
            "name": "Ricardo Ferreira"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207660,
                "name": "Tools and techniques"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "549984",
        "title": "Your Cloud-Native Toolbox for Java",
        "description": "What does it mean to have cloud-native Java applications? What do you need to think about to be a good Cloud citizen?\r\n\r\nIt is not about the platform you run it on or the library/framework you want to use. It is about how you build scalable, observable, resilient applications while keeping in mind the application architecture, containers, builds, testing, automation, and standards.\r\n\r\nJoin us in exploring different tools for creating cloud-native Java apps. We will go through the whole life-cycle of an application – from the first lines of code to a fully operational and containerized application.",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "ad998165-d26a-4c98-8aac-ee60a16c638a",
            "name": "Rustam Mehmandarov"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207657,
                "name": "Java Platform"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      },
      {
        "questionAnswers": [],
        "id": "556492",
        "title": "Zero to Implementation in 50 Minutes, No Kidding!",
        "description": "If you separate yourself from the distractions you typically see when analyzing business requirements you quickly realize that they are usually fairly simple. You may or may not have to consume some input. You may or may not have to produce some output. That is all! This means that implementing and testing the actual requirements should be significantly more straightforward than what most developers experience in real life. And then there is another set of distractions where many developers come up with a complete design of a solution to a requirement, now treating such a solution as a requirement. Without realizing that their design is not the requirement they miss out on the simpler and better solution.  What are those distractions, how to spot them, and how Spring can help you deal with them?",
        "startsAt": null,
        "endsAt": null,
        "isServiceSession": false,
        "isPlenumSession": false,
        "speakers": [
          {
            "id": "61524dab-5ff7-443b-a97f-ae7d6f5690ec",
            "name": "Oleg Zhurakousky"
          },
          {
            "id": "25b4a764-0ab3-4a6b-b7b6-8e5f5d46dfc6",
            "name": "Glenn Renfro"
          }
        ],
        "categories": [
          {
            "id": 59536,
            "name": "Track",
            "categoryItems": [
              {
                "id": 207656,
                "name": "Frameworks"
              }
            ],
            "sort": 0
          },
          {
            "id": 59537,
            "name": "Session Format",
            "categoryItems": [
              {
                "id": 207665,
                "name": "session"
              }
            ],
            "sort": 1
          }
        ],
        "roomId": null,
        "room": null,
        "liveUrl": null,
        "recordingUrl": null,
        "status": "Accepted",
        "isInformed": false,
        "isConfirmed": false
      }
    ],
    "isDefault": false
  }
]